/*Создайте программу, которая запрашивает у пользователя два целых числа a и b, после чего выводит на экран результаты следующих математических операций: 
 - сумма a и b; 

- разница между a и b;

- произведение a и b; 

- частное от деления a на b; 

- остаток от деления a на b;  

- результат возведения числа a в степень b 

Сложение +,
Вычитание -,
Умножение *,
Деление /,
Взятие остатка от деления %,
Возведение в степень **.*/

// - сумма a и b;

let a = "4";
let b = "8";
console.log( a - b );

// - произведение a и b;

let a = "12";
let b = "2";
console.log( a * b ); 


// - частное от деления a на b; 

let a = "10";
let b = "4";
console.log( a % b );

//- остаток от деления a на b; 

let a = "10";
let b = "4";
console.log( a ** b );

//- результат возведения числа a в степень b 
